information = [[[7, 'Сборочные единицы', 'RC09.01.06.02.01.000 Внутренняя обойма', 1, 'шт.', 'RC09.01.06.02.00.000', 'Сталь 10  ГОСТ 1050-2013', '', ''], [6, 'Сборочные единицы', 'RC09.01.06.02.02.000 Привод в сборе', 1, 'шт.', 'RC09.01.06.02.00.000', 'Сталь 10  ГОСТ 1050-2013', '', ''], [5, 'Сборочные единицы', 
'RC09.01.06.02.03.000-01 Кабельная сборка со скользящим контактом', 1, 'шт.', 'RC09.01.06.02.00.000', 'Полиэтилен ВД  ГОСТ 16337-77', '', 'Внимание! Слайдер из состава сборки заказан заранее '], [3, 'Детали', 'RC08.01.06.04.00.001 Втулка привода поворота плеча', 1, 'шт.', 'RC09.01.06.02.00.000', 'Круг ф100 Полиацеталь ПОМ черный', '(ТЕСТ) Покрытие: азотирование h 6-9 мкм. ', 'Заимствуется в RC09'], [0, 'Детали', 'RC09.01.06.02.00.001 Колесо с внутренним зацеплением z30', 1, 'шт.', 'RC09.01.06.02.00.000', 'Круг ф100 Полиацеталь ПОМ черный', '', ''], [0, 'Детали', 'RC09.01.06.02.00.002 Фланец связи', 1, 'шт.', 'RC09.01.06.02.00.000', '1000х1000х18 мм, Алюминий Д16Т', '', ''], [0, 'Детали', 'RC09.01.06.02.00.003 Фланец СК', 1, 'шт.', 'RC09.01.06.02.00.000', 'Круг ф100 Полиацеталь ПОМ черный', '', ''], [0, 'Детали', 'RC09.01.06.02.00.004 Прижимная планка', 1, 'шт.', 'RC09.01.06.02.00.000', 
'PETG FDM (цвет см. в ТТ)', '', 'БЧ. FDM печать, слой 0,2-0,24 (мм), заполнение 25-50%, 4 нижних и 4 верхних слоя, стенка 3 слоя.'], [0, 'Детали', 'ISO 7991 Винт M3*6 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000', '', '', 'Требуется покупка (либо доработка DIN 965 Винт М3*8 мм Цинк)'], [0, 'Стандартные изделия', 'DIN 965 Винт М3*5 мм Цинк', 2, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [0, 'Стандартные изделия', 'DIN 965 Винт М4*6 мм Цинк', 1, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', 'Технологический винт (удалить после калибровки рук)'], [0, 'Стандартные изделия', 'DIN 912 Винт M2*3 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [0, 'Стандартные изделия', 'ISO 7380 Винт М4*20 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [0, 'Стандартные изделия', 'ISO 7991 Винт M3*20 мм Нерж.', 8, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [0, 'Стандартные изделия', 'DIN 912 Винт М3*12 мм Цинк', 5, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [0, 'Стандартные изделия', 'MH-946 MH-947 Подшипник 1 АХК+2 AS 4565', 1, 'шт.', 'RC09.01.06.02.00.000', 'Сталь 10  ГОСТ 1050-2013', '', ''], [0, 'Стандартные изделия', 'Подшипник 61809 (SKF)', 1, 'шт.', 'RC09.01.06.02.00.000', 'Сталь 10  ГОСТ 1050-2013', '', ' https://mechanictrade.ru/catalog/podshipniki/sharikovyie-radialnyie-odnoryadnyie/otkryitogo/zakryitogo-tipa/5374 ']]]

def sort_func(r):
    x = r.split(' ')
    if '.' in x[0] and len(x[0].split('.')) > 2:
        return x[0]
    else:
        return 'ЯЯЯЯЯЯЯ'

def info_sort(info):
    for i in range(len(info)):
        info[i].sort(key = lambda x: x[0])
        if 0 not in info[i][0]: 
            info[i].sort(key = lambda x: x[0])
        else:
            for k in range(len(info[i])): 
                info[i].sort(key = lambda x: x[2])
                info[i].sort(key = lambda x: sort_func(x[2]))
                info[i].sort(key = lambda x: x[1] == 'Документация')
                info[i].sort(key = lambda x: x[1] == 'Комплексы')
                info[i].sort(key = lambda x: x[1] == 'Сборочные еденицы')
                info[i].sort(key = lambda x: x[1] == 'Детали')
                info[i].sort(key = lambda x: x[1] == 'Стандартные изделия')
                info[i].sort(key = lambda x: x[1] == 'Прочие изделия')
                info[i].sort(key = lambda x: x[1] == 'Материалы')
                info[i].sort(key = lambda x: x[1] == 'Комплекты')
    return info

#info_sort(information)