info = [[[6, 'Детали', 'RC08.01.06.04.00.001 Втулка привода поворота плеча', 1, 'шт.', 'RC09.01.06.02.00.000', 'Круг ф100 Полиацеталь ПОМ черный', '(ТЕСТ) Покрытие: азотирование h 6-9 мкм. ', 'Заимствуется в RC09'], [0, 'Сборочные единицы', 'RC09.01.06.02.02.000 Привод в сборе', 1, 'шт.', 'RC09.01.06.02.00.000', 'Сталь 10  ГОСТ 1050-2013', '', ''], [16, 'Стандартные изделия', 'ISO 7380 Винт М4*20 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [0, 'Сборочные единицы', 'RC09.01.06.02.01.000 Внутренняя обойма', 1, 'шт.', 'RC09.01.06.02.00.000', 'Сталь 10  ГОСТ 1050-2013', '', ''], [7, 'Детали', 'RC09.01.06.02.00.001 Колесо с внутренним зацеплением z30', 1, 'шт.', 'RC09.01.06.02.00.000', 'Круг ф100 Полиацеталь ПОМ черный', '', 
''], [21, 'Стандартные изделия', 'Подшипник 61809 (SKF)', 1, 'шт.', 'RC09.01.06.02.00.000', 'Сталь 10  ГОСТ 1050-2013', '', ' https://mechanictrade.ru/catalog/podshipniki/sharikovyie-radialnyie-odnoryadnyie/otkryitogo/zakryitogo-tipa/5374 '], [20, 'Стандартные изделия', 'MH-946 MH-947 Подшипник 1 АХК+2 AS 4565', 1, 'шт.', 'RC09.01.06.02.00.000', 'Сталь 10  ГОСТ 1050-2013', '', ''], [8, 'Детали', 'RC09.01.06.02.00.002 Фланец связи', 1, 'шт.', 'RC09.01.06.02.00.000', '1000х1000х18 мм, Алюминий Д16Т', '', ''], [18, 'Стандартные изделия', 'ISO 7991 Винт M3*20 мм Нерж.', 8, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [14, 'Стандартные изделия', 'DIN 965 Винт М4*6 мм Цинк', 1, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', 'Технологический винт (удалить после калибровки рук)'], [9, 'Детали', 'RC09.01.06.02.00.003 Фланец СК', 1, 'шт.', 'RC09.01.06.02.00.000', 'Круг ф100 Полиацеталь ПОМ черный', '', ''], [15, 'Стандартные изделия', 'DIN 912 Винт M2*3 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [13, 'Стандартные изделия', 'DIN 965 Винт М3*5 мм Цинк', 2, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', ''], [10, 'Детали', 'RC09.01.06.02.00.004 Прижимная планка', 1, 'шт.', 'RC09.01.06.02.00.000', 'PETG FDM (цвет см. в ТТ)', '', 'БЧ. FDM печать, слой 0,2-0,24 (мм), заполнение 25-50%, 4 нижних и 4 верхних слоя, стенка 3 слоя.'], [3, 'Сборочные единицы', 'RC09.01.06.02.03.000-01 Кабельная сборка со скользящим контактом', 1, 'шт.', 'RC09.01.06.02.00.000', 'Полиэтилен ВД  ГОСТ 16337-77', '', 'Внимание! Слайдер из состава сборки заказан заранее '], [17, 'Детали', 'ISO 7991 Винт M3*6 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000', '', '', 'Требуется покупка (либо доработка DIN 965 Винт М3*8 мм Цинк)'], [19, 'Стандартные изделия', 'DIN 912 Винт М3*12 мм Цинк', 5, 'шт.', 'RC09.01.06.02.00.000', 'Не определено', '', '']], [[6, 'Детали', 'RC08.01.06.04.00.001 Втулка привода поворота плеча', 1, 
'шт.', 'RC09.01.06.02.00.000-01', 'Круг ф100 Полиацеталь ПОМ черный', '(ТЕСТ) Покрытие: азотирование h 6-9 мкм. ', 'Заимствуется в RC09'], [2, 'Сборочные единицы', 'RC09.01.06.02.02.000 Привод в сборе', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Сталь 10  ГОСТ 1050-2013', '', ''], [16, 'Стандартные изделия', 'ISO 7380 Винт М4*20 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Не определено', '', ''], [1, 'Сборочные единицы', 'RC09.01.06.02.01.000 Внутренняя обойма', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Сталь 10  ГОСТ 1050-2013', '', ''], [7, 'Детали', 'RC09.01.06.02.00.001 Колесо с внутренним зацеплением z30', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Круг ф100 Полиацеталь ПОМ черный', '', ''], [21, 'Стандартные изделия', 'Подшипник 61809 (SKF)', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Сталь 10  ГОСТ 1050-2013', '', ' https://mechanictrade.ru/catalog/podshipniki/sharikovyie-radialnyie-odnoryadnyie/otkryitogo/zakryitogo-tipa/5374 '], [20, 'Стандартные изделия', 'MH-946 MH-947 Подшипник 1 АХК+2 AS 4565', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Сталь 10  ГОСТ 1050-2013', '', ''], [8, 'Детали', 'RC09.01.06.02.00.002-01 Фланец связи', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Д16  ГОСТ 4784-2019', '', ''], [18, 'Стандартные изделия', 'ISO 7991 Винт M3*20 мм Нерж.', 8, 'шт.', 'RC09.01.06.02.00.000-01', 'Не определено', '', ''], [14, 'Стандартные изделия', 'DIN 965 Винт М4*6 мм Цинк', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Не определено', '', ''], [9, 'Детали', 'RC09.01.06.02.00.003 Фланец СК', 1, 
'шт.', 'RC09.01.06.02.00.000-01', 'Круг ф100 Полиацеталь ПОМ черный', '', ''], [13, 'Стандартные изделия', 'DIN 965 Винт М3*5 мм Цинк', 2, 'шт.', 'RC09.01.06.02.00.000-01', 'Не определено', '', ''], [15, 'Стандартные изделия', 'DIN 912 Винт M2*3 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Не определено', '', ''], [10, 'Детали', 'RC09.01.06.02.00.004 Прижимная планка', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'PETG FDM (цвет см. в ТТ)', '', 'БЧ. FDM печать, слой 0,2-0,24 (мм), заполнение 25-50%, 4 нижних и 4 верхних слоя, стенка 3 слоя.'], [3, 'Сборочные единицы', 'RC09.01.06.02.03.000-01 Кабельная сборка со скользящим контактом', 1, 'шт.', 'RC09.01.06.02.00.000-01', 'Полиэтилен ВД  ГОСТ 16337-77', '', 'Внимание! Слайдер из состава сборки заказан заранее '], [17, 'Детали', 'ISO 7991 Винт M3*6 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000-01', '', '', ''], [19, 'Стандартные изделия', 'DIN 912 Винт М3*12 мм Цинк', 5, 'шт.', 'RC09.01.06.02.00.000-01', 'Не определено', '', '']], [[6, 'Детали', 'RC08.01.06.04.00.001 Втулка привода поворота плеча', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Круг ф100 Полиацеталь ПОМ черный', '(ТЕСТ) Покрытие: азотирование h 6-9 мкм. ', 'Заимствуется в RC09'], [2, 'Сборочные единицы', 'RC09.01.06.02.02.000 Привод в сборе', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Сталь 10  ГОСТ 1050-2013', '', ''], [16, 'Стандартные изделия', 'ISO 7380 Винт М4*20 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Не определено', '', ''], [1, 'Сборочные единицы', 'RC09.01.06.02.01.000 Внутренняя обойма', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Сталь 10  ГОСТ 1050-2013', '', ''], [7, 'Детали', 'RC09.01.06.02.00.001 Колесо с внутренним зацеплением z30', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Круг ф100 Полиацеталь ПОМ черный', '', ''], [21, 'Стандартные изделия', 'Подшипник 61809 (SKF)', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Сталь 10  ГОСТ 1050-2013', '', ' https://mechanictrade.ru/catalog/podshipniki/sharikovyie-radialnyie-odnoryadnyie/otkryitogo/zakryitogo-tipa/5374 '], [20, 'Стандартные изделия', 'MH-946 MH-947 Подшипник 1 АХК+2 AS 4565', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Сталь 10  ГОСТ 1050-2013', '', ''], [8, 'Детали', 'RC09.01.06.02.00.002-02 Фланец связи', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Д16  ГОСТ 4784-2019', '', ''], [18, 'Стандартные изделия', 'ISO 7991 Винт M3*20 мм Нерж.', 8, 'шт.', 'RC09.01.06.02.00.000-02', 'Не определено', '', ''], [14, 'Стандартные изделия', 'DIN 965 Винт М4*6 мм Цинк', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Не определено', '', ''], [9, 'Детали', 'RC09.01.06.02.00.003 Фланец СК', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Круг ф100 Полиацеталь ПОМ черный', '', ''], [13, 'Стандартные изделия', 'DIN 965 Винт М3*5 мм Цинк', 2, 'шт.', 'RC09.01.06.02.00.000-02', 'Не определено', '', ''], [15, 'Стандартные изделия', 'DIN 912 Винт M2*3 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Не определено', '', ''], [10, 'Детали', 'RC09.01.06.02.00.004 Прижимная планка', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'PETG FDM (цвет см. в ТТ)', 
'', 'БЧ. FDM печать, слой 0,2-0,24 (мм), заполнение 25-50%, 4 нижних и 4 верхних слоя, стенка 3 слоя.'], [3, 'Сборочные единицы', 'RC09.01.06.02.03.000-01 Кабельная сборка со скользящим контактом', 1, 'шт.', 'RC09.01.06.02.00.000-02', 'Полиэтилен ВД  ГОСТ 16337-77', '', 'Внимание! Слайдер из состава сборки заказан заранее '], [17, 'Детали', 'ISO 7991 Винт M3*6 мм Нерж.', 1, 'шт.', 'RC09.01.06.02.00.000-02', '', '', ''], [19, 'Стандартные изделия', 'DIN 912 Винт М3*12 мм Цинк', 5, 'шт.', 'RC09.01.06.02.00.000-02', 'Не определено', '', '']]]

def sort_func(r):
    x = r.split(' ')
    if '.' in x[0] and len(x[0].split('.')) > 2:
        return x[0]
    else:
        return 'ЯЯЯЯЯЯЯ'

def sort_dse(name, info):
    buf_info = []
    for i in range(len(info)):
        if name in info[i]:
            buf_info.append(info[i])
    buf_info.sort(key = lambda x: sort_func(x[2]))
    buf_info.sort(key = lambda x: x[0])
    return buf_info

def info_sort(info):
    info_sorted = []
    for i in range(len(info)):
        new_info = []
        buffer = sort_dse('Документация', info[i])
        for k in range(len(buffer)):
            new_info.append(buffer[k])
        buffer = sort_dse('Комплексы', info[i])
        for k in range(len(buffer)):
            new_info.append(buffer[k])
        buffer = sort_dse('Сборочные единицы', info[i])
        for k in range(len(buffer)):
            new_info.append(buffer[k])
        buffer = sort_dse('Детали', info[i])
        for k in range(len(buffer)):
            new_info.append(buffer[k])
        buffer = sort_dse('Стандартные изделия', info[i])
        for k in range(len(buffer)):
            new_info.append(buffer[k])
        buffer = sort_dse('Прочие изделия', info[i])
        for k in range(len(buffer)):
            new_info.append(buffer[k])
        buffer = sort_dse('Материалы', info[i])  
        for k in range(len(buffer)):
            new_info.append(buffer[k])
        buffer = sort_dse('Комплекты', info[i])
        for k in range(len(buffer)):
            new_info.append(buffer[k])
        info_sorted.append(new_info)
    return info_sorted