from openpyxl import load_workbook
import openpyxl
import os

#info = [[[3, '', 'Деталь', 2, 'шт.', '', 'Сталь 10  ГОСТ 1050-2013', '', ''], [1, 'Стандартные изделия', 'Заклепка 2,5x14.37 ГОСТ 10302-80', '1', 'шт.', '', 'АД1 ГОСТ 4784-97', '', ''], [1, 'Стандартные изделия', 'Гвозди  1,6x12 ГОСТ 4033-63', '1', 'шт.', '', '', '', '']], 
#        [[3, '', 'Деталь', 2, 'шт.', '-01', 'Сталь 10  ГОСТ 1050-2013', '', ''], [1, 'Стандартные изделия', 'Заклепка 2,5x14.37 ГОСТ 10302-80', '1', 'шт.', '-01', 'АД1 ГОСТ 4784-97', '', ''], [1, 'Стандартные изделия', 'Гвозди  1,6x12 ГОСТ 4033-63', '1', 'шт.', '-01', '', '', '']], 
#        [[3, '', 'Деталь', 2, 'шт.', '-02', 'Сталь 10  ГОСТ 1050-2013', '', ''], [1, 'Стандартные изделия', 'Заклепка 2,5x14.37 ГОСТ 10302-80', '1', 'шт.', '-02', 'АД1 ГОСТ 4784-97', '', ''], [1, 'Стандартные изделия', 'Гвозди  1,6x12 ГОСТ 4033-63', '1', 'шт.', '-02', '', '', '']], 
#        [[3, '', 'Деталь', 2, 'шт.', '-03', 'Сталь 10  ГОСТ 1050-2013', '', ''], [1, 'Стандартные изделия', 'Заклепка 2,5x14.37 ГОСТ 10302-80', '1', 'шт.', '-03', 'АД1 ГОСТ 4784-97', '', ''], [1, 'Стандартные изделия', 'Гвозди  1,6x12 ГОСТ 4033-63', '1', 'шт.', '-03', '', '', '']], 
#        [[3, '', 'Деталь', 2, 'шт.', '-04', 'Сталь 10  ГОСТ 1050-2013', '', ''], [1, 'Стандартные изделия', 'Заклепка 2,5x14.37 ГОСТ 10302-80', '1', 'шт.', '-04', 'АД1 ГОСТ 4784-97', '', ''], [1, 'Стандартные изделия', 'Гвозди  1,6x12 ГОСТ 4033-63', '1', 'шт.', '-04', '', '', ''], [4, '', 'Деталькааа', 1, 'шт.', '-04', 'Сталь 25Г2С  ГОСТ 5781-82', '', '']]]
#settings = [1, 1, 1, 1, 1, 1, 1, 1]
#path = 'C:/Users/odrin/Desktop/макросф/Приложение/Копия Спецификация (Шаблон).xlsx'

# Функция открытия и записи в таблицу значений, где path - путь до таблицы, cols - массив с массивами строк значений
def save_file(path, settings, info):     
    file = path
    wb = load_workbook(file)
    ws = wb.active  # Получим активный лист таблицы
    row = 7
    columns = []
    if settings[0]: columns.append(2)
    if settings[1]: columns.append(3)
    if settings[2]: columns.append(4)
    if settings[3]: 
        columns.append(5)
        columns.append(6)
    if settings[4]: columns.append(8)
    if settings[5]: columns.append(9)
    if settings[6]: columns.append(10)
    if settings[7]: columns.append(11)
    # Запишем перебором массива значения в каждую из строк таблицы
    for row_txt in range(row, row + len(info)): 
        txt=info[row_txt-row]
        a=0
        for col_txt in columns:
            value_txt = txt[a]
            a=a+1
            ws.cell(row=row_txt, column=col_txt).value = value_txt
    # Сохраним файл и откроем в excel 
    wb.save(file)
    os.startfile(file)